INSERT INTO public.lessons (title, unit_id,sort_order) VALUES
('الجهاز العصبي', 1, 1),
('النسيج العصبي', 1, 2),
('الجهاز العصبي المحيطي', 1, 3),
('خواص الأعصاب', 1, 4),
('الظواهر الكهربائية في الخلايا الحية', 1, 5),
('النقل في الأعصاب', 1, 6),
('وظائف الجهاز العصبي 1', 1, 7),
('وظائف الجهاز العصبي 2', 1, 8),
('وظائف الجهاز العصبي 3', 1, 9),
('الفعل المنعكس', 1, 10),
('بعض أمراض الجهاز العصبي', 1, 11),
-----
('مفهوم المستقبلات الحسية', 2, 1),
('المستقبلات الحسية في الجلد', 2, 2),
('المستقبلات الكيميائية', 2, 3),
('المستقبلات الصوتية', 2, 4),
('مستقبلات التوازن', 2, 5),
('المستقبلات الضوئية (1)', 2, 6),
('المستقبلات الضوئية (2)', 2, 7),
-----
('التنسيق الهرموني عند الإنساس', 3, 1),
('الغدة النخامية', 3, 2),
('الغدة الدرقية', 3, 3),
('آليات السيطرة على أفراز الغدد الصم', 3, 4),
('التنسيق الكيميائي لدى النبات', 3, 5),
('تتمة التنسيق الكيميائي في النبات', 3, 6),
('تكاثر الفيروسات', 4, 1),
('التكاثر عند الأحياء', 4, 2),
('التقانات الحيوية', 4, 3),
('الخلايا الجذعية', 4, 4),
('تكاثر الجراثيم والفطريات', 4, 5),
('التكاثر الجنسي لدى عاريات البذور', 4, 6),
('التكاثر الجنسي لدى مغلفات البذور', 4, 7),
('منشأ جهاز التكاثر لدى الانسان', 4, 8),
('جهاز التكاثر الذكري', 4, 9),
('تشكل النطاف واهميتها', 4, 10),
('جهاز التكاثر الأنثوي', 4, 11),
('الدورة الجنسية', 4, 12),
('التنامي الجنيني (الإلقاح)', 4, 13),
('التنامي الجنيني (التعشيش والحمل)', 4, 14),
('الولادة والإرضاع', 4, 15),
('الصحة الإنجابية', 4, 16),
-----
('تجارب مندل في الوراثة', 5, 1),
('التهجين الاختباري', 5, 2),
('تأثر المورثات وتعديلات النسب المندلية في الهجونة', 5, 3),
('المورثات المتتامة', 5, 4),
('الحجب الراجح', 5, 5),
('الارتباط والعبور', 5, 6),
('تحديد الجنس لدى الأحياء', 5, 7),
('الوراثة عند الإنسان', 5, 8),
('الطفرات', 5, 9),
('الهندسة الوراثية', 5, 10);










